target/classes/com/cisco/framework/utilities/unittests/MultiplyRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Multiply>
         <tem:num1>arg1</tem:num1>
         <tem:num2>arg2</tem:num2>
      </tem:Multiply>
   </soapenv:Body>
</soapenv:Envelope>