trunk/bin/com/compuware/gdo/framework/utilities/unittests/DivideRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Divide>
         <tem:num1>arg1</tem:num1>
         <tem:num2>arg2</tem:num2>
      </tem:Divide>
   </soapenv:Body>
</soapenv:Envelope>